rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP | RCC_PERIPHCLK_CSI;
  PeriphClkInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
  PeriphClkInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  PeriphClkInitStruct.ICSelection[RCC_IC17].ClockDivider = 4;
  PeriphClkInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  /* 1.2 GHz / 50 = 24 MHz, which matches the IMX335 input clock setting. */
  PeriphClkInitStruct.ICSelection[RCC_IC18].ClockDivider = 50;

  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
 * @brief Mark the camera DMA buffer region as non-cacheable.
 *
 * This mirrors the ST reference application, which places capture buffers in a
 * dedicated memory section and protects that section with the MPU so DCMIPP
 * writes are visible to the CPU without stale-cache effects.
 */
static void Setup_Mpu(void)
{
  MPU_Attributes_InitTypeDef attr = {0};
  MPU_Region_InitTypeDef region = {0};
  size_t noncacheable_size = (size_t)((uint8_t *)&__enoncacheable -
                                      (uint8_t *)&__snoncacheable);

  attr.Number = MPU_ATTRIBUTES_NUMBER0;
  attr.Attributes = MPU_NOT_CACHEABLE;
  HAL_MPU_ConfigMemoryAttributes(&attr);

  region.Enable = MPU_REGION_ENABLE;
  region.Number = MPU_REGION_NUMBER0;
  region.BaseAddress = (uint32_t) &__snoncacheable;
  region.LimitAddress = (uint32_t) &__enoncacheable - 1U;
  region.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
  region.AccessPermission = MPU_REGION_ALL_RW;
  region.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  region.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
  region.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  HAL_MPU_ConfigRegion(&region);
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
  /* NOTE: do NOT memset the noncacheable buffer here — it lives at the NS alias
   * address (0x24xxxxxx) which RISAF1 may not yet be open at this point in the
   * init sequence.  The capture code fills the buffer with 0xAA sentinel before
   * each DMA, so zero-init here is not required. */
}

/**
  * @brief Convert a packed BCD byte into binary.
  * @param value Packed BCD value from the DS3231.
  * @retval Converted binary value.
  */
static uint8_t DS3231_BcdToBin(uint8_t value)
{
  return (uint8_t)(((value >> 4U) * 10U) + (value & 0x0FU));
}

/**
  * @brief Decode a DS3231 hour register into 24-hour binary form.
  * @param value Raw hour register byte.
  * @retval Hour in the range 0-23.
  */
static uint8_t DS3231_DecodeHour(uint8_t value)
{
  if ((value & 0x40U) == 0U)
  {
    return DS3231_BcdToBin((uint8_t) (value & 0x3FU));
  }

  uint8_t hour = DS3231_BcdToBin((uint8_t) (value & 0x1FU));
  if ((value & 0x20U) != 0U)
  {
    if (hour != 12U)
    {
      hour = (uint8_t) (hour + 12U);
    }
  }
  else if (hour == 12U)
  {
    hour = 0U;
  }

  return hour;
}

/**
  * @brief Log the I2C1 pin state so we can spot wiring or pull-up issues.
  *
  * This cannot prove the solder bridges themselves, but it does tell us whether
  * the firmware sees PC1/PH9 configured and whether the bus is idling high.
  */
static void DS3231_LogI2c1LineState(void)
{
  uint32_t pc1_moder = (GPIOC->MODER >> (1U * 2U)) & 0x3U;
  uint32_t ph9_moder = (GPIOH->MODER >> (9U * 2U)) & 0x3U;
  uint32_t pc1_pupdr = (GPIOC->PUPDR >> (1U * 2U)) & 0x3U;
  uint32_t ph9_pupdr = (GPIOH->PUPDR >> (9U * 2U)) & 0x3U;
  uint32_t pc1_afr = (GPIOC->AFR[0] >> (1U * 4U)) & 0xFU;
  uint32_t ph9_afr = (GPIOH->AFR[1] >> ((9U - 8U) * 4U)) & 0xFU;
  GPIO_PinState sda_state = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_1);
  GPIO_PinState scl_state = HAL_GPIO_ReadPin(GPIOH, GPIO_PIN_9);

  DebugConsole_Printf(
      "[RTC] I2C1 lines: PC1(MODE=%lu PUPD=%lu AF=%lu state=%u) PH9(MODE=%lu PUPD=%lu AF=%lu state=%u)\r\n",
      (unsigned long) pc1_moder, (unsigned long) pc1_pupdr,
      (unsigned long) pc1_afr, (unsigned int) sda_state,
      (unsigned long) ph9_moder, (unsigned long) ph9_pupdr,
      (unsigned long) ph9_afr, (unsigned int) scl_state);
}

/**
  * @brief Scan the I2C1 bus for any responding device addresses.
  *
  * This keeps the output compact while telling us whether the RTC is missing,
  * mis-addressed, or blocked by routing/pull-up issues.
  */
static void DS3231_ScanI2C1Bus(void)
{
  uint32_t found_count = 0U;
  char found_list[128] = {0};
  size_t used = 0U;

  DebugConsole_Printf("[RTC] I2C1 scan starting.\r\n");

  for (uint32_t address = 0x03U; address <= 0x77U; ++address)
  {
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t) (address << 1U), 1U, 10U) == HAL_OK)
    {
      if (found_count == 0U)
      {
        used = (size_t) snprintf(found_list, sizeof(found_list), "[RTC] I2C1 ACKs:");
      }

      if (used < sizeof(found_list))
      {
        int written = snprintf(&found_list[used], sizeof(found_list) - used,
                               " 0x%02lX", (unsigned long) address);
        if (written > 0)
        {
          used += (size_t) written;
        }
      }

      ++found_count;
    }
  }

  if (found_count > 0U)
  {
    DebugConsole_Printf("%s\r\n", found_list);
  }
  else
  {
    DebugConsole_Printf("[RTC] I2C1 scan found no ACKs.\r\n");
  }
}

/**
  * @brief Read the DS3231 clock registers and format a timestamp.
  * @param buffer Output buffer for the human-readable time string.
  * @param buffer_length Size of the output buffer.
  * @retval true when the RTC replied with a valid timestamp.
  */
static bool DS3231_ReadDateTime(char *buffer, size_t buffer_length)
{
  uint8_t raw_registers[7] = {0};
  HAL_StatusTypeDef status;
  int printed = 0;

  if ((buffer == NULL) || (buffer_length == 0U))
  {
    return false;
  }

  status = HAL_I2C_IsDeviceReady(&hi2c1, DS3231_I2C_ADDRESS_HAL,
                                 DS3231_I2C_PROBE_TRIALS,
                                 DS3231_I2C_PROBE_TIMEOUT_MS);
  if (status != HAL_OK)
  {
    return false;
  }

  status = HAL_I2C_Mem_Read(&hi2c1, DS3231_I2C_ADDRESS_HAL, 0x00U,
                            I2C_MEMADD_SIZE_8BIT, raw_registers,
                            sizeof(raw_registers), 100U);
  if (status != HAL_OK)
  {
    return false;
  }

  printed = snprintf(buffer, buffer_length,
                     "%04u-%02u-%02u %02u:%02u:%02u",
                     (unsigned int) (2000U + DS3231_BcdToBin(raw_registers[6])),
                     (unsigned int) DS3231_BcdToBin((uint8_t) (raw_registers[5] & 0x1FU)),
                     (unsigned int) DS3231_BcdToBin(raw_registers[4]),
                     (unsigned int) DS3231_DecodeHour(raw_registers[2]),
                     (unsigned int) DS3231_BcdToBin(raw_registers[1]),
                     (unsigned int) DS3231_BcdToBin((uint8_t) (raw_registers[0] & 0x7FU)));
  return (printed > 0) && ((size_t) printed < buffer_length);
}

/**
  * @brief Try to read the DS3231 clock registers a few times before giving up.
  * @param buffer Output buffer for the human-readable time string.
  * @param buffer_length Size of the output buffer.
  * @retval true when the RTC replied with a valid timestamp.
  */
static bool DS3231_ReadDateTimeWithRetry(char *buffer, size_t buffer_length)
{
  for (uint32_t attempt = 0U; attempt < DS3231_READ_RETRY_ATTEMPTS; ++attempt)
  {
    if (DS3231_ReadDateTime(buffer, buffer_length))
    {
      return true;
    }

